Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD11_DFP/2.0.20/Microchip.SAMD11_DFP.pdsc
      <condition id="ATSAMD11C14A">
         <require Dvendor="Microchip:3" Dname="ATSAMD11C14A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMD11D14AS">
         <description>Headers and startup code for Microchip ATSAMD11D14AS</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd11d14as.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd11d14as.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd11d14as_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd11d14as_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd11d14as.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd11d14as.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd11d14as.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd11d14as.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd11d14as/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd11d14as/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMD11D14AU">
         <description>Headers and startup code for Microchip ATSAMD11D14AU</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd11d14au.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd11d14au.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd11d14au_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd11d14au_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd11d14au.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd11d14au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd11d14au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd11d14au.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd11d14au/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd11d14au/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMD11D14AM">
         <description>Headers and startup code for Microchip ATSAMD11D14AM</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd11d14am.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd11d14am.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd11d14am_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd11d14am_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd11d14am.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd11d14am.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd11d14am.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd11d14am.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd11d14am/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd11d14am/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMD11C14A">
         <description>Headers and startup code for Microchip ATSAMD11C14A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd11c14a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd11c14a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd11c14a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd11c14a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd11c14a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd11c14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd11c14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd11c14a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd11c14a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd11c14a/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
